# concat

In [2]:
import numpy as np
import pandas as pd

In [3]:
sozluk1 = {"Isim": ["Ahmet","Mehmet","Zeynep","Atıl"],"Spor": ["Yüzme","Koşu","Futbol","Yürüyüş"], "Kalori": [100,200,300,400]}

In [4]:
dataFrame1 = pd.DataFrame(sozluk1,index=[0,1,2,3])

In [5]:
dataFrame1

     Isim     Spor  Kalori
0   Ahmet    Yüzme     100
1  Mehmet     Koşu     200
2  Zeynep   Futbol     300
3    Atıl  Yürüyüş     400

In [6]:
sozluk2 = {"Isim": ["Ayşe","Fatma","Melis","Deniz"], "Spor": ["Yürüyüş","Koşu","Basketbol","Yüzme"], "Kalori": [250,350,450,550]}

In [7]:
dataFrame2= pd.DataFrame(sozluk2, index= [4,5,6,7])

In [8]:
dataFrame2

    Isim       Spor  Kalori
4   Ayşe    Yürüyüş     250
5  Fatma       Koşu     350
6  Melis  Basketbol     450
7  Deniz      Yüzme     550

In [9]:
sozluk3 = {"Isim":["Mahmut","Tolga","Gökay"], "Spor": ["Koşu","Yüzme","Yürüyüş"], "Kalori":[375,450,600]}

In [10]:
dataFrame3 = pd.DataFrame(sozluk3, index= [8,9,10])

In [11]:
dataFrame3

      Isim     Spor  Kalori
8   Mahmut     Koşu     375
9    Tolga    Yüzme     450
10   Gökay  Yürüyüş     600

# concatenation

In [12]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

      Isim       Spor  Kalori
0    Ahmet      Yüzme     100
1   Mehmet       Koşu     200
2   Zeynep     Futbol     300
3     Atıl    Yürüyüş     400
4     Ayşe    Yürüyüş     250
5    Fatma       Koşu     350
6    Melis  Basketbol     450
7    Deniz      Yüzme     550
8   Mahmut       Koşu     375
9    Tolga      Yüzme     450
10   Gökay    Yürüyüş     600

# merging / merge

In [13]:
mergeSozluk1 = {"Isim": ["Ahmet","Mehmet","Zeynep","Atıl"], "Spor": ["Yüzme","Koşu","Yürüyüş","Basketbol"]}

In [14]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1, index=[0,1,2,3])

In [15]:
mergeDataFrame1

     Isim       Spor
0   Ahmet      Yüzme
1  Mehmet       Koşu
2  Zeynep    Yürüyüş
3    Atıl  Basketbol

In [16]:
mergeSozluk2 = {"Isim": ["Ahmet","Mehmet","Zeynep","Atıl"], "Kalori": [200,300,400,500]}

In [17]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2, index = [0,1,2,3])

In [18]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     200
1  Mehmet     300
2  Zeynep     400
3    Atıl     500

In [19]:
pd.merge(mergeDataFrame1, mergeDataFrame2, on="Isim")

     Isim       Spor  Kalori
0   Ahmet      Yüzme     200
1  Mehmet       Koşu     300
2  Zeynep    Yürüyüş     400
3    Atıl  Basketbol     500

# İleri Operasyonlar

In [20]:
maasSozluk = {"Isim": ["Ahmet","Mehmet","Ayşe","Fatma"], "Departman": ["Yazılım","Satış","Pazarlama","Yazılım"], "Maas": [100,200,300,400]}

In [21]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [22]:
maasDataFrame

     Isim  Departman  Maas
0   Ahmet    Yazılım   100
1  Mehmet      Satış   200
2    Ayşe  Pazarlama   300
3   Fatma    Yazılım   400

In [23]:
maasDataFrame["Departman"]

0      Yazılım
1        Satış
2    Pazarlama
3      Yazılım
Name: Departman, dtype: object

In [24]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [25]:
maasDataFrame["Departman"].nunique()

3

In [26]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Pazarlama    1
Satış        1
Name: Departman, dtype: int64

In [27]:
def bruttenNete(maas):
    return maas * 0.66

In [28]:
maasDataFrame["Maas"].apply(bruttenNete)

0     66.0
1    132.0
2    198.0
3    264.0
Name: Maas, dtype: float64

In [29]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

# pivottable

In [30]:
yeniBirVeri = {"Karakter Sınıfı": ["South Park","South Park","Simpson","Simpson"], 
               "Karakter Ismi": ["Cartman","Kenny","Homer","Bart"], 
               "Karakter Yas": [9,10,50,30]}

In [31]:
karakterDF =pd.DataFrame(yeniBirVeri)

In [33]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            30

In [34]:
karakterDF.pivot_table(values = "Karakter Yas", index=["Karakter Sınıfı","Karakter Ismi"])

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10